app/controllers/pomodoro_settings_controller.rb

SELECT "pomodoro_settings".* FROM "pomodoro_settings" WHERE "pomodoro_settings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
  def home
    # ポモドーロの保持の有無判定
    if current_user&.pomodoro_settings&.exists?
      @pomodoro_settings = current_user.pomodoro_settings.includes(:user)
    else
      @pomodoro_settings = nil
      @default_pomodoro = PomodoroSetting.includes(:user).find(1)